# Personal data analysis on marital status, existing loans, education, profession etc. and its impact on the campaignâ€™s success.

In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame

#Displaying the Tables

In [2]:
df0=pd.read_csv('Customer_campaign_details_p1.csv')
df0
df0.head()

,Customer_id,contact,month,day_of_week,duration,campaign,pdays,previous,poutcome
0,1,telephone,may,mon,307,1,999,0,nonexistent
1,2,telephone,may,mon,198,1,999,0,nonexistent
2,3,telephone,may,mon,139,1,999,0,nonexistent
3,4,telephone,may,mon,217,1,999,0,nonexistent
4,5,telephone,may,mon,380,1,999,0,nonexistent

In [3]:
df1 = pd.read_csv('Customer_and_bank details_p1.csv')
df1
df1.head()

,Customer_id,age,job,marital,education,default,housing,loan,Region_Code,State_Code,City_Code
0,1,56,services,married,high.school,no,no,yes,3,S1,C1
1,2,45,services,married,basic.9y,unknown,no,no,3,S1,C1
2,3,59,admin.,married,professional.course,no,no,no,4,S2,C2
3,4,41,blue-collar,married,unknown,unknown,no,no,3,S3,C3
4,5,24,technician,single,professional.course,no,yes,no,3,S3,C3

In [4]:
df2 = pd.read_csv('Customer_Response_data_p1.csv')
df2
df2.head()

   Customer_id   y
0            1  no
1            2  no
2            3  no
3            4  no
4            5  no

###merging Customer_and_bank details_p1.csv and Customer_Response_data_p1.csv(tables)

In [5]:
grouph=pd.merge(df1,df2,on='Customer_id',how='inner')
grouph.head()

,Customer_id,age,job,marital,education,default,housing,loan,Region_Code,State_Code,City_Code,y
0,1,56,services,married,high.school,no,no,yes,3,S1,C1,no
1,2,45,services,married,basic.9y,unknown,no,no,3,S1,C1,no
2,3,59,admin.,married,professional.course,no,no,no,4,S2,C2,no
3,4,41,blue-collar,married,unknown,unknown,no,no,3,S3,C3,no
4,5,24,technician,single,professional.course,no,yes,no,3,S3,C3,no

##analysis on martial status based on responses

In [6]:
grouph1=grouph.groupby('marital')['y'].value_counts()
grouph1

marital   y
divorced  no      3699
          yes      427
married   no     20187
          yes     2292
single    no      8930
          yes     1477
unknown   no        60
          yes       12
Name: y, dtype: int64

#analysis on loan based on responses

In [7]:
grouph2=grouph.groupby('loan')['y'].value_counts()
grouph2

loan     y
no       no     27062
         yes     3499
unknown  no       791
         yes       91
yes      no      5023
         yes      618
Name: y, dtype: int64

#analysis on education based on responses

In [8]:
grouph3=grouph.groupby('education')['y'].value_counts()
grouph3

education            y
basic.4y             no     3374
                     yes     391
basic.6y             no     1903
                     yes     171
basic.9y             no     5001
                     yes     420
high.school          no     7597
                     yes     945
illiterate           no       14
                     yes       2
professional.course  no     4205
                     yes     541
university.degree    no     9464
                     yes    1507
unknown              no     1318
                     yes     231
Name: y, dtype: int64

#analysis on profession based on responses

In [9]:
grouph4=grouph.groupby('job')['y'].value_counts()
grouph4

job            y
admin.         no     8174
               yes    1246
blue-collar    no     7738
               yes     576
entrepreneur   no     1198
               yes     111
housemaid      no      853
               yes      93
management     no     2345
               yes     292
retired        no     1146
               yes     395
self-employed  no     1145
               yes     131
services       no     3249
               yes     298
student        no      527
               yes     240
technician     no     5439
               yes     657
unemployed     no      791
               yes     134
unknown        no      271
               yes      35
Name: y, dtype: int64

#analysis on housing based on responses

In [10]:
grouph5=grouph.groupby('housing')['y'].value_counts()
grouph5

housing  y
no       no     14931
         yes     1838
unknown  no       791
         yes       91
yes      no     17154
         yes     2279
Name: y, dtype: int64

#analysis on age based on responses

In [15]:
grouph6=grouph.groupby('age')['y'].value_counts()
grouph6

age  y
17   no      3
     yes     2
18   no     15
     yes     9
19   no     21
            ..
92   yes     3
     no      1
94   no      1
95   no      1
98   yes     2
Name: y, Length: 149, dtype: int64

 #merging Customer_and_bank details_p1.csv and Customer_Campaign_data_p1.csv(tables)

In [11]:
group=pd.merge(df0,df1,on='Customer_id',how='inner')
group
group.head()

,Customer_id,contact,month,day_of_week,duration,campaign,pdays,previous,poutcome,age,job,marital,education,default,housing,loan,Region_Code,State_Code,City_Code
0,1,telephone,may,mon,307,1,999,0,nonexistent,56,services,married,high.school,no,no,yes,3,S1,C1
1,2,telephone,may,mon,198,1,999,0,nonexistent,45,services,married,basic.9y,unknown,no,no,3,S1,C1
2,3,telephone,may,mon,139,1,999,0,nonexistent,59,admin.,married,professional.course,no,no,no,4,S2,C2
3,4,telephone,may,mon,217,1,999,0,nonexistent,41,blue-collar,married,unknown,unknown,no,no,3,S3,C3
4,5,telephone,may,mon,380,1,999,0,nonexistent,24,technician,single,professional.course,no,yes,no,3,S3,C3

#analysis on martial status based on poutcome

In [25]:
marital_success=group.groupby('marital')['poutcome'].value_counts()
marital_success

marital   poutcome
divorced  nonexistent     3562
          failure          452
          success          112
married   nonexistent    19674
          failure         2146
          success          659
single    nonexistent     8729
          failure         1215
          success          463
unknown   nonexistent       58
          failure            9
          success            5
Name: poutcome, dtype: int64


#calculating percentage on martial status analysis

In [44]:
print('The percentage turnout of maritalstatus')

The percentage turnout of maritalstatus

In [45]:
percent = group['marital'].value_counts()/len(group['marital'])*100
percent

married     60.616438
single      28.063316
divorced    11.126092
unknown      0.194154
Name: marital, dtype: float64

#analysis on existing loans based on poutcome

In [47]:
loan_success=group.groupby('loan')['poutcome'].value_counts()
loan_success

loan     poutcome
no       nonexistent    26389
         failure         3141
         success         1031
unknown  nonexistent      756
         failure          101
         success           25
yes      nonexistent     4878
         failure          580
         success          183
Name: poutcome, dtype: int64

#calculating percentage on existing analysis

In [46]:
print('The percentage turnout of loan')

The percentage turnout of loan

In [42]:
percent1 = group['loan'].value_counts()/len(group['loan'])*100
percent1

no         82.410204
yes        15.211412
unknown     2.378384
Name: loan, dtype: float64

#analysis on education based on poutcome

In [49]:
education_success=group.groupby('education')['poutcome'].value_counts()
education_success

education            poutcome
basic.4y             nonexistent    3332
                     failure         316
                     success         117
basic.6y             nonexistent    1838
                     failure         200
                     success          36
basic.9y             nonexistent    4764
                     failure         563
                     success          94
high.school          nonexistent    7278
                     failure         996
                     success         268
illiterate           nonexistent      14
                     failure           1
                     success           1
professional.course  nonexistent    4116
                     failure         463
                     success         167
university.degree    nonexistent    9375
                     failure        1118
                     success         478
unknown              nonexistent    1306
                     failure         165
                     success          78
Name: poutcome, dtype: int64

#calculating percentage on education analysis

In [50]:
print('The percentage turnout of education')

The percentage turnout of education

In [51]:
percent2 = group['education'].value_counts()/len(group['education'])*100
percent2

university.degree      29.584187
high.school            23.034193
basic.9y               14.618164
professional.course    12.797972
basic.4y               10.152626
basic.6y                5.592708
unknown                 4.177004
illiterate              0.043145
Name: education, dtype: float64

#analysis on profession based on poutcome

In [13]:
job_success=group.groupby('job')['poutcome'].value_counts()
job_success

job            poutcome
admin.         nonexistent    8037
               failure         987
               success         396
blue-collar    nonexistent    7412
               failure         800
               success         102
entrepreneur   nonexistent    1147
               failure         140
               success          22
housemaid      nonexistent     847
               failure          64
               success          35
management     nonexistent    2257
               failure         292
               success          88
retired        nonexistent    1195
               failure         203
               success         143
self-employed  nonexistent    1119
               failure         132
               success          25
services       nonexistent    3088
               failure         397
               success          62
student        nonexistent     519
               failure         138
               success         110
technician     nonexistent    5349
               failure         567
               success         180
unemployed     nonexistent     783
               failure          85
               success          57
unknown        nonexistent     270
               success          19
               failure          17
Name: poutcome, dtype: int64

#calculating percentage on profession analysis

In [14]:
percent4= group['job'].value_counts()/len(group['job'])*100
percent4

admin.           25.401791
blue-collar      22.419372
technician       16.438356
services          9.564772
management        7.110883
retired           4.155431
entrepreneur      3.529824
self-employed     3.440837
housemaid         2.550965
unemployed        2.494337
student           2.068277
unknown           0.825154
Name: job, dtype: float64

#analysis on housing based on poutcome

In [53]:
housing_success=group.groupby('housing')['poutcome'].value_counts()
housing_success

housing  poutcome
no       nonexistent    14662
         failure         1594
         success          513
unknown  nonexistent      756
         failure          101
         success           25
yes      nonexistent    16605
         failure         2127
         success          701
Name: poutcome, dtype: int64

#calculating percentage on housing analysis

In [54]:
print('The percentage turnout of housing')

The percentage turnout of housing

In [55]:
percent3 = group['housing'].value_counts()/len(group['housing'])*100
percent3

yes        52.402653
no         45.218962
unknown     2.378384
Name: housing, dtype: float64